УТ_для_edt/src/Reports/CRM_СтруктураВзаимосвязейМеждуКлиентами/CRM_СтруктураВзаимосвязейМеждуКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>CRM_СтруктураВзаимосвязейМеждуКлиентами</name>
</mdclass:Report>

УТ_для_edt/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>bpmХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>bpmТипПроцесса</name>
    <type>
      <types>EnumRef.bpmТипыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>bpmХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>bpmСостояниеПроцесса</name>
    <type>
      <types>EnumRef.bpmСостояниеПроцесса</types>
    </type>
  </attributes>
  <attributes>
    <name>bpmВидОбъектаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>bpmИспользоватьПриПринятииОбращения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>bpmРеквизитОбъектаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_КартаМаршрута</name>
    <type>
      <types>CatalogRef.CRM_КартыМаршрутов</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_КомментарийHTML</name>
    <comment>Описание проекта в HTML</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_КонтактноеЛицоПартнера</name>
    <comment>Контактное лицо партнера</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПараметрыАвтостарта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Партнер</name>
    <comment>Партнер</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Периодический</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Планируемый</name>
    <comment>Если установлен флажок, то возможно планирование</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ТекущийЭтап</name>
    <comment>Текущий этап проекта</comment>
    <type>
      <types>CatalogRef.CRM_ЭтапыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЭтоПроект</name>
    <comment>Флаг: Процесс или проект</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Статус</name>
    <type>
      <types>EnumRef.CRM_СтатусыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПрогнозЗавершенияПроекта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ТипУслуги</name>
    <type>
      <types>CatalogRef.CRM_ТипУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Интерес</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_КолонкиКалендарногоГрафика</name>
    <comment>Список колонок для отображения в календарном графике проекта</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьbpmВидОбъекта</name>
    <type>
      <types>EnumRef.bpmВидыОбъектовПроцесса</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПартнерыИКонтактныеЛица</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>РольПартнера</name>
      <type>
        <types>CatalogRef.РолиПартнеровВСделкахИПроектах</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Reports/CRM_СтруктураВзаимосвязейМеждуКлиентами/Forms/ФормаОтчета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МодульУправлениеДоступом = CRM_ОбщегоНазначенияСервер.ОбщийМодуль("CRM_УправлениеДоступом");
	Если МодульУправлениеДоступом <> Неопределено Тогда
		МодульУправлениеДоступом.ОграничитьВыводКлиентскойБазы(ЭтотОбъект, "ДеревоРезультат");
	КонецЕсли;
	
	Если Не Параметры.Свойство("Партнер") Тогда
		ВызватьИсключение НСтр("ru='Отчет не предназначен для непосредственного использования.';en='The report is not intended for direct use.'");
	КонецЕсли;
	
	Если Параметры.Свойство("Партнер") Тогда
		Если	ТипЗнч(Параметры.Партнер) = Тип("СправочникСсылка.Партнеры")
			И	ЗначениеЗаполнено(Параметры.Партнер)
			И	Не Параметры.Партнер.ЭтоГруппа Тогда
			//
			Партнер = Параметры.Партнер;
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Партнер) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Заголовок = НСтр("ru='Структура взаимосвязей клиента';en='Customer Relationship Structure'") + " """ + Строка(Партнер) + """";
	
	ОбновитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
	СтрокиДерева = ДеревоРезультат.ПолучитьЭлементы();
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Элементы.ДеревоРезультат.Развернуть(СтрокаДерева.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьПредставлениеВидаСвязи(ВидСвязи, Прямое)
	Если Прямое Тогда
		Если ЗначениеЗаполнено(ВидСвязи.Наименование) Тогда
			Возврат ВидСвязи.Наименование;
		Иначе
			Возврат ВидСвязи.РольПартнера1;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(ВидСвязи.ОбратноеНаименование) Тогда
			Возврат ВидСвязи.ОбратноеНаименование;
		ИначеЕсли ЗначениеЗаполнено(ВидСвязи.Наименование) Тогда
			Возврат ВидСвязи.Наименование;
		Иначе
			Возврат ВидСвязи.РольПартнера2;
		КонецЕсли;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ВернутьПроектыПоКлиенту(Клиент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер",Клиент);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CRM_БизнесПроцесс.Проект
	|ПОМЕСТИТЬ ВсеПроекты
	|ИЗ
	|	БизнесПроцесс.CRM_БизнесПроцесс КАК CRM_БизнесПроцесс
	|ГДЕ
	|	CRM_БизнесПроцесс.Партнер = &Партнер
	|	И НЕ CRM_БизнесПроцесс.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|	И CRM_БизнесПроцесс.Стартован
	|	И НЕ CRM_БизнесПроцесс.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Проекты.Ссылка
	|ИЗ
	|	Справочник.Проекты КАК Проекты
	|ГДЕ
	|	НЕ Проекты.ПометкаУдаления
	|	И Проекты.CRM_Партнер = &Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеПроекты.Проект КАК Проект
	|ИЗ
	|	ВсеПроекты КАК ВсеПроекты";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Проект");
	
КонецФункции

&НаСервере
Процедура СформироватьРекурсивно(ПартнерСсылка, ТаблицаСвязейПартнеров, СтрокиДерева, ТаблицаВыведенныхСвязей, Дерево)
	НайденныеСтроки1 = ТаблицаСвязейПартнеров.НайтиСтроки(Новый Структура("ПервыйПартнер", ПартнерСсылка));
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки1 Цикл
		Партнер1 = НайденнаяСтрока.ПервыйПартнер;
		Партнер2 = НайденнаяСтрока.ВторойПартнер;
		НайденныеСтрокиВыведенные = ТаблицаВыведенныхСвязей.НайтиСтроки(Новый Структура("ПервыйПартнер,ВторойПартнер,ВидСвязи", Партнер1, Партнер2, НайденнаяСтрока.ВидСвязи));
		Если НайденныеСтрокиВыведенные.Количество() > 0 Тогда Продолжить; КонецЕсли;
		НайденныеСтрокиВыведенные = ТаблицаВыведенныхСвязей.НайтиСтроки(Новый Структура("ПервыйПартнер,ВторойПартнер,ВидСвязи", Партнер2, Партнер1, НайденнаяСтрока.ВидСвязи));
		Если НайденныеСтрокиВыведенные.Количество() > 0 Тогда Продолжить; КонецЕсли;
		
		ВывестиПроекты = (Дерево.Строки.Найти(Партнер1,"Партнер1",Истина)=Неопределено);
		
		НоваяСтрока = СтрокиДерева.Добавить();
		НоваяСтрока.Партнер1 = Партнер1;
		НоваяСтрока.Партнер2 = Партнер2;
		НоваяСтрока.ВидСвязиСсылка = НайденнаяСтрока.ВидСвязи;
		ПредставлениеВидСвязи = ПолучитьПредставлениеВидаСвязи(НайденнаяСтрока.ВидСвязи, Истина);
		НоваяСтрока.ВидСвязиПредставление = ПредставлениеВидСвязи;
		Если НоваяСтрока.Партнер1 = Партнер Тогда
			НоваяСтрока.Оформление = 7;
		ИначеЕсли НоваяСтрока.Партнер2 = Партнер Тогда
			НоваяСтрока.Оформление = 6;
		КонецЕсли;
		
		НоваяСтрокаВыведенные = ТаблицаВыведенныхСвязей.Добавить();
		НоваяСтрокаВыведенные.ПервыйПартнер = Партнер1;
		НоваяСтрокаВыведенные.ВторойПартнер = Партнер2;
		НоваяСтрокаВыведенные.ВидСвязи = НайденнаяСтрока.ВидСвязи;
		
		СформироватьРекурсивно(НоваяСтрока.Партнер2, ТаблицаСвязейПартнеров, НоваяСтрока.Строки, ТаблицаВыведенныхСвязей, Дерево);
		
		Если ВывестиПроекты Тогда
			МассивПроектов = ВернутьПроектыПоКлиенту(Партнер1);
			Для Каждого ПроектКлиента Из МассивПроектов Цикл
				НоваяСтрока = СтрокиДерева.Добавить();
				НоваяСтрока.Партнер1 = "-";
				НоваяСтрока.Партнер2 = ПроектКлиента;
				НоваяСтрока.ВидСвязиПредставление = "Проект";
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	НайденныеСтроки2 = ТаблицаСвязейПартнеров.НайтиСтроки(Новый Структура("ВторойПартнер", ПартнерСсылка));
	Для Каждого НайденнаяСтрока Из НайденныеСтроки2 Цикл
		Партнер1 = НайденнаяСтрока.ВторойПартнер;
		Партнер2 = НайденнаяСтрока.ПервыйПартнер;
		НайденныеСтрокиВыведенные = ТаблицаВыведенныхСвязей.НайтиСтроки(Новый Структура("ПервыйПартнер,ВторойПартнер,ВидСвязи", Партнер1, Партнер2, НайденнаяСтрока.ВидСвязи));
		Если НайденныеСтрокиВыведенные.Количество() > 0 Тогда Продолжить; КонецЕсли;
		НайденныеСтрокиВыведенные = ТаблицаВыведенныхСвязей.НайтиСтроки(Новый Структура("ПервыйПартнер,ВторойПартнер,ВидСвязи", Партнер2, Партнер1, НайденнаяСтрока.ВидСвязи));
		Если НайденныеСтрокиВыведенные.Количество() > 0 Тогда Продолжить; КонецЕсли;
		
		ВывестиПроекты = (Дерево.Строки.Найти(Партнер1,"Партнер1",Истина)=Неопределено);
		
		НоваяСтрока = СтрокиДерева.Добавить();
		НоваяСтрока.Партнер1 = Партнер1;
		НоваяСтрока.Партнер2 = Партнер2;
		НоваяСтрока.ВидСвязиСсылка = НайденнаяСтрока.ВидСвязи;
		ПредставлениеВидСвязи = ПолучитьПредставлениеВидаСвязи(НайденнаяСтрока.ВидСвязи, Ложь);
		НоваяСтрока.ВидСвязиПредставление = ПредставлениеВидСвязи;
		Если НоваяСтрока.Партнер1 = Партнер Тогда
			НоваяСтрока.Оформление = 7;
		ИначеЕсли НоваяСтрока.Партнер2 = Партнер Тогда
			НоваяСтрока.Оформление = 6;
		КонецЕсли;
		
		НоваяСтрокаВыведенные = ТаблицаВыведенныхСвязей.Добавить();
		НоваяСтрокаВыведенные.ПервыйПартнер = Партнер1;
		НоваяСтрокаВыведенные.ВторойПартнер = Партнер2;
		НоваяСтрокаВыведенные.ВидСвязи = НайденнаяСтрока.ВидСвязи;
		
		СформироватьРекурсивно(НоваяСтрока.Партнер2, ТаблицаСвязейПартнеров, НоваяСтрока.Строки, ТаблицаВыведенныхСвязей, Дерево);
		
		Если ВывестиПроекты Тогда
			МассивПроектов = ВернутьПроектыПоКлиенту(Партнер1);
			Для Каждого ПроектКлиента Из МассивПроектов Цикл
				НоваяСтрока = СтрокиДерева.Добавить();
				НоваяСтрока.Партнер1 = "-";
				НоваяСтрока.Партнер2 = ПроектКлиента;
				НоваяСтрока.ВидСвязиПредставление = "Проект";
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	Дерево = РеквизитФормыВЗначение("ДеревоРезультат");
	Дерево.Строки.Очистить();
	
	ТаблицаСвязейПартнеров = CRM_МетодыМодулейМенеджеровРегистров.ПолучитьТаблицуСвязейПартнера(Партнер);
	ТаблицаСвязейПартнеров.Сортировать("ВидСвязи ВОЗР");
	
	ВывестиПроекты = Ложь;
	
	СтрокиДерева = Дерево.Строки;
	
	ТаблицаПартнеры = Новый ТаблицаЗначений();
	ТаблицаПартнеры.Колонки.Добавить("Партнер");
	Для Каждого СтрокаТаблицы Из ТаблицаСвязейПартнеров Цикл
		НоваяСтрока = ТаблицаПартнеры.Добавить();
		НоваяСтрока.Партнер = СтрокаТаблицы.ПервыйПартнер;
		НоваяСтрока = ТаблицаПартнеры.Добавить();
		НоваяСтрока.Партнер = СтрокаТаблицы.ВторойПартнер;
	КонецЦикла;
	
	ТаблицаСвязейПартнеров.Сортировать("ВидСвязи,ВторойПартнер");
	
	ТаблицаПартнеры.Свернуть("Партнер");
	ТаблицаПартнеры.Сортировать("Партнер ВОЗР");
	НоваяСтрока = ТаблицаПартнеры.Вставить(0);
	НоваяСтрока.Партнер = Партнер;
	ТаблицаПартнеры.Свернуть("Партнер");
	
	ТаблицаВыведенныхСвязей = ТаблицаСвязейПартнеров.Скопировать(Новый Массив());
	
	Для Каждого СтрокаТаблицы Из ТаблицаПартнеры Цикл
		СформироватьРекурсивно(СтрокаТаблицы.Партнер, ТаблицаСвязейПартнеров, СтрокиДерева, ТаблицаВыведенныхСвязей, Дерево);
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоРезультат");
	
КонецПроцедуры

#КонецОбласти
